Repository: xxshubhamxx/cmux-panecho
Catalog: Packages/Shared/CMUXMobileCore/Sources/CMUXMobileCore/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, ja, ko, zh_hans, zh_hant

# diagnostics.failure.routeGated
source: Route already connecting
ar: الطريق متصل بالفعل
de: Route ist bereits verbunden
es: Ruta que ya conecta
fr: Itinéraire déjà connecté
ja: 経路はすでに接続中です
ko: 이미 연결 중인 경로
zh_hans: 路线已连接
zh_hant: 路線已連接

# diagnostics.failure.secureChannelFailed
source: Secure channel failed
ar: فشلت القناة الآمنة
de: Der sichere Kanal ist fehlgeschlagen
es: Error en el canal seguro
fr: Échec du canal sécurisé
ja: セキュアチャネルの確立に失敗しました
ko: 보안 채널 실패
zh_hans: 安全通道失败
zh_hant: 安全通道失敗

# diagnostics.failure.sendQueueOverflow
source: Send queue overflow
ar: إرسال تجاوز قائمة الانتظار
de: Überlauf der Sendewarteschlange
es: Enviar cola desbordada
fr: Débordement de file d'attente d'envoi
ja: 送信キューがあふれました
ko: 보내기 대기열 오버플로
zh_hans: 发送队列溢出
zh_hant: 發送隊列溢出

# diagnostics.failure.superseded
source: Superseded by a newer attempt
ar: تم استبداله بمحاولة أحدث
de: Durch einen neueren Versuch ersetzt
es: Reemplazado por un nuevo intento
fr: Remplacé par une tentative plus récente
ja: 新しい試行に置き換えられました
ko: 새로운 시도로 대체됨
zh_hans: 被更新的尝试取代
zh_hant: 被更新的嘗試取代

# diagnostics.failure.timedOut
source: Timed out
ar: انتهت المهلة
de: Zeitüberschreitung
es: Tiempo agotado
fr: Délai expiré
ja: タイムアウト
ko: 시간 초과
zh_hans: 超时
zh_hant: 超時

# diagnostics.failure.transportIdleTimedOut
source: Transport idle timed out
ar: انتهت مهلة النقل في وضع الخمول
de: Zeitüberschreitung beim Leerlauf des Transports
es: Se agotó el tiempo de inactividad del transporte
fr: Le délai d'inactivité du transport a expiré
ja: トランスポートのアイドルタイムアウト
ko: 전송 유휴 시간이 초과되었습니다.
zh_hans: 传输空闲超时
zh_hant: 傳輸空閒逾時

# diagnostics.failure.unknown
source: Unknown failure
ar: فشل غير معروف
de: Unbekannter Fehler
es: Fallo desconocido
fr: Panne inconnue
ja: 不明なエラー
ko: 알 수 없는 실패
zh_hans: 未知故障
zh_hant: 未知故障

# diagnostics.failure.unsupportedRoute
source: Unsupported route
ar: مسار غير معتمد
de: Nicht unterstützte Route
es: Ruta no admitida
fr: Itinéraire non pris en charge
ja: サポートされていない経路
ko: 지원되지 않는 경로
zh_hans: 不支持的路线
zh_hant: 不支援的路線

# diagnostics.field.applicationErrorCode
source: Application error code
ar: رمز خطأ التطبيق
de: Anwendungsfehlercode
es: Código de error de la aplicación
fr: Code d'erreur de l'application
ja: アプリケーションエラーコード
ko: 애플리케이션 오류 코드
zh_hans: 应用程序错误代码
zh_hant: 應用程式錯誤代碼

# diagnostics.field.attempt
source: Attempt
ar: محاولة
de: Versuchen
es: Intentar
fr: Tentative
ja: 試行
ko: 시도
zh_hans: 试图
zh_hant: 試圖

# diagnostics.field.composerActive
source: Composer active
ar: الملحن نشط
de: Komponist aktiv
es: Compositor activo
fr: Compositeur actif
ja: コンポーザー稼働中
ko: 작곡가 활동 중
zh_hans: 作曲家活跃
zh_hant: 作曲家活躍

# diagnostics.field.composerVisible
source: Composer visible
ar: الملحن مرئية
de: Komponist sichtbar
es: Compositor visible
fr: Compositeur visible
ja: コンポーザー表示中
ko: 작곡가 표시
zh_hans: 作曲家可见
zh_hant: 作曲家可見

# diagnostics.field.count
source: Count
ar: عدد
de: Zählen
es: Contar
fr: Compter
ja: 件数
ko: 세다
zh_hans: 数数
zh_hant: 數數

# diagnostics.field.deliveredSequence
source: Delivered sequence
ar: تسلسل تسليمها
de: Gelieferte Sequenz
es: Secuencia entregada
fr: Séquence livrée
ja: 配信済みシーケンス
ko: 전달된 순서
zh_hans: 交付序列
zh_hant: 交付序列

# diagnostics.field.detail1
source: Detail 1
ar: التفاصيل 1
es: Detalle 1
fr: Détail 1
ja: 詳細1
ko: 세부사항 1
zh_hans: 细节1
zh_hant: 細節1

# diagnostics.field.detail2
source: Detail 2
ar: التفاصيل 2
es: Detalle 2
fr: Détail 2
ja: 詳細2
ko: 세부사항 2
zh_hans: 细节2
zh_hant: 細節2

# diagnostics.field.detail3
source: Detail 3
ar: التفاصيل 3
es: Detalle 3
fr: Détail 3
ja: 詳細3
ko: 세부사항 3
zh_hans: 细节3
zh_hant: 細節3

# diagnostics.field.draftEmpty
source: Draft empty
ar: المسودة فارغة
de: Entwurf leer
es: Borrador vacío
fr: Brouillon vide
ja: 下書きは空
ko: 초안이 비어 있음
zh_hans: 吃水空
zh_hant: 吃水空

# diagnostics.field.draftSize
source: Draft size
ar: حجم المسودة
de: Entwurfsgröße
es: Tamaño del borrador
fr: Taille du brouillon
ja: 下書きサイズ
ko: 초안 크기
zh_hans: 拔模尺寸
zh_hant: 拔模尺寸

# diagnostics.field.duration
source: Duration
ar: مدة
de: Dauer
es: Duración
fr: Durée
ja: 期間
ko: 지속
zh_hans: 期间
zh_hant: 期間

# diagnostics.field.failure
source: Failure
ar: سبب الفشل
de: Fehlergrund
es: Fallo
fr: Échec
ja: エラー
ko: 실패
zh_hans: 失败
zh_hant: 失敗

# diagnostics.field.firstResponder
source: First responder
ar: المستجيب الأول
de: Ersthelfer
es: Primer respondedor
fr: Premier intervenant
ja: ファーストレスポンダ
ko: 최초 대응자
zh_hans: 第一响应者
zh_hant: 第一響應者

# diagnostics.field.focused
source: Focused
ar: ركز
de: Konzentriert
es: enfocado
fr: Concentré
ja: フォーカス中
ko: 집중
zh_hans: 专注
zh_hant: 專注

# diagnostics.field.initiator
source: Initiator
ar: البادئ
es: Iniciador
fr: Initiateur
ja: 開始元
ko: 창시자
zh_hans: 引发者
zh_hant: 引發者

# diagnostics.field.keyboardHeight
source: Keyboard height
ar: ارتفاع لوحة المفاتيح
de: Tastaturhöhe
es: Altura del teclado
fr: Hauteur du clavier
ja: キーボードの高さ
ko: 키보드 높이
zh_hans: 键盘高度
zh_hant: 鍵盤高度

# diagnostics.field.lag
source: Lag
ar: تأخر
de: Verzögerung
es: Retraso
fr: Décalage
ja: 遅延
ko: 지연
zh_hans: 落后
zh_hant: 落後

# diagnostics.field.localSequence
source: Local sequence
ar: التسلسل المحلي
de: Lokale Reihenfolge
es: secuencia local
fr: Séquence locale
ja: ローカルシーケンス
ko: 로컬 시퀀스
zh_hans: 局部序列
zh_hant: 局部序列

# diagnostics.field.network
source: Network
ar: شبكة
de: Netzwerk
es: Red
fr: Réseau
ja: ネットワーク
ko: 회로망
zh_hans: 网络
zh_hant: 網路

# diagnostics.field.nextSequence
source: Next sequence
ar: التسلسل التالي
de: Nächste Sequenz
es: Siguiente secuencia
fr: Séquence suivante
ja: 次のシーケンス
ko: 다음 순서
zh_hans: 下一个序列
zh_hant: 下一個序列

# diagnostics.field.operation
source: Operation
ar: عملية
de: Betrieb
es: Operación
fr: Opération
ja: 操作
ko: 작업
zh_hans: 手术
zh_hant: 手術

# diagnostics.field.path
source: Path
ar: طريق
de: Weg
es: Camino
fr: Chemin
ja: 経路
ko: 길
zh_hans: 小路
zh_hant: 小路

# diagnostics.field.phase
source: Phase
ar: مرحلة
es: Fase
ja: フェーズ
ko: 단계
zh_hans: 阶段
zh_hant: 階段

# diagnostics.field.purpose
source: Purpose
ar: غاية
de: Zweck
es: Objetivo
fr: But
ja: 用途
ko: 목적
zh_hans: 目的
zh_hant: 目的

# diagnostics.field.remoteSequence
source: Remote sequence
ar: التسلسل عن بعد
de: Remote-Sequenz
es: Secuencia remota
fr: Séquence à distance
ja: リモートシーケンス
ko: 원격 시퀀스
zh_hans: 远程序列
zh_hant: 遠端序列

# diagnostics.field.retryDelay
source: Retry delay
ar: إعادة محاولة التأخير
de: Wiederholungsverzögerung
es: Retraso de reintento
fr: Délai de nouvelle tentative
ja: 再試行まで
ko: 재시도 지연
zh_hans: 重试延迟
zh_hant: 重試延遲

# diagnostics.field.session
source: Session
ar: حصة
de: Sitzung
es: Sesión
ja: セッション
ko: 세션
zh_hans: 会议
zh_hant: 會議

# diagnostics.field.silentFor
source: Silent for
ar: صامت ل
de: Schweigen für
es: Silencioso por
fr: Silencieux pour
ja: 無通信時間
ko: 다음에 대해 무음
zh_hans: 沉默为
zh_hant: 沉默為

# diagnostics.field.state
source: State
ar: ولاية
de: Zustand
es: Estado
fr: État
ja: 状態
ko: 상태
zh_hans: 状态
zh_hant: 狀態

# diagnostics.field.surface
source: Surface
ar: سطح
de: Oberfläche
es: Superficie
ja: サーフェス
ko: 표면
zh_hans: 表面
zh_hant: 表面

# diagnostics.field.terminalInputFocused
source: Terminal input focused
ar: تركز المدخلات الطرفية
de: Terminaleingabe konzentriert
es: Entrada de terminal enfocada
fr: Entrée du terminal concentrée
ja: ターミナル入力にフォーカス
ko: 터미널 입력 집중
zh_hans: 终端输入重点
zh_hant: 終端機輸入重點

# diagnostics.field.transport
source: Transport
ar: ينقل
es: Transporte
ja: トランスポート
ko: 수송
zh_hans: 运输
zh_hant: 運輸

# diagnostics.field.trigger
source: Trigger
ar: مشغل
de: Auslösen
es: Desencadenar
fr: Déclenchement
ja: トリガー
ko: 방아쇠
zh_hans: 扳机
zh_hant: 扳機

# diagnostics.field.value
source: Value
ar: قيمة
de: Wert
es: Valor
fr: Valeur
ja: 値
ko: 값
zh_hans: 价值
zh_hant: 價值

# diagnostics.incident.consecutiveFailures
source: %lld consecutive failures
ar: %lld حالات فشل متتالية
de: %lld aufeinanderfolgende Fehler
es: %lld errores consecutivos
fr: %lld échecs consécutifs
ja: %lld回連続の失敗
ko: %lld개의 연속 실패
zh_hans: %lld 次连续失败
zh_hant: %lld 次連續失敗

# diagnostics.incident.occurrences
source: %lld occurrences
ar: %lld تكرارًا
de: %lld Vorkommen
es: %lld ocurrencias
ja: %lld回
ko: %lld번 발생
zh_hans: %lld 次出现
zh_hant: %lld 次出現

# diagnostics.incident.outage
source: Transport outage: %1$@ over %2$@. Latest: %3$@
ar: انقطاع النقل: %1$@ عبر %2$@. الأحدث: %3$@
de: Transportausfall: %1$@ über %2$@. Neueste: %3$@
es: Interrupción del transporte: %1$@ sobre %2$@. Último: %3$@
fr: Panne de transport : %1$@ sur %2$@. Dernier : %3$@
ja: トランスポート障害: %1$@が%2$@にわたって発生しました。最新: %3$@
ko: 전송 중단: %2$@를 통한 %1$@. 최신: %3$@

# diagnostics.lanDiscovery.found
source: Advertisement found
ar: تم العثور على إعلان
de: Anzeige gefunden
es: Anuncio encontrado
fr: Annonce trouvée
ja: アドバタイズを発見しました
ko: 광고 발견
zh_hans: 发现广告
zh_hant: 發現廣告

# diagnostics.lanDiscovery.noAuthority
source: No broker LAN authority
ar: لا توجد سلطة LAN وسيط
de: Keine Broker-LAN-Berechtigung
es: Sin autoridad LAN de intermediario
fr: Aucune autorité LAN du courtier
ja: ブローカーのLAN権限がありません
ko: 브로커 LAN 권한 없음
zh_hans: 无经纪人LAN权限
zh_hant: 無經紀人LAN權限

# diagnostics.lanDiscovery.notFound
source: Advertisement not found
ar: لم يتم العثور على الإعلان
de: Anzeige nicht gefunden
es: Anuncio no encontrado
fr: Annonce introuvable
ja: アドバタイズが見つかりません
ko: 광고를 찾을 수 없습니다
zh_hans: 未找到广告
zh_hant: 未找到廣告

# diagnostics.lanDiscovery.policyDenied
source: Local Network permission denied
ar: تم رفض إذن الشبكة المحلية
de: Die Berechtigung für das lokale Netzwerk wurde verweigert
es: Permiso de red local denegado
fr: Autorisation du réseau local refusée
ja: ローカルネットワーク権限が拒否されました
ko: 로컬 네트워크 권한이 거부되었습니다.
zh_hans: 本地网络权限被拒绝
zh_hant: 本地網路權限被拒絕

# diagnostics.lanPublication.active
source: Advertising
ar: دعاية
de: Werbung
es: Publicidad
fr: Publicité
ja: アドバタイズ中
ko: 광고
zh_hans: 广告
zh_hant: 廣告

# diagnostics.lanPublication.inactive
source: Stopped
ar: توقف
de: Angehalten
es: Interrumpido
fr: Arrêté
ja: 停止中
ko: 중지됨
zh_hans: 已停止
zh_hant: 已停止

# diagnostics.lanPublication.policyDenied
source: Local Network permission denied
ar: تم رفض إذن الشبكة المحلية
de: Die Berechtigung für das lokale Netzwerk wurde verweigert
es: Permiso de red local denegado
fr: Autorisation du réseau local refusée
ja: ローカルネットワーク権限が拒否されました
ko: 로컬 네트워크 권한이 거부되었습니다.
zh_hans: 本地网络权限被拒绝
zh_hant: 本地網路權限被拒絕

# diagnostics.lanPublication.unavailable
source: Registration failing
ar: فشل التسجيل
de: Registrierung fehlgeschlagen
es: Error de registro
fr: Échec de l'enregistrement
ja: 登録に失敗しています
ko: 등록 실패
zh_hans: 注册失败
zh_hant: 註冊失敗

# diagnostics.lanPublicationReason.applied
source: Settings applied
ar: تم تطبيق الإعدادات
de: Einstellungen angewendet
es: Configuración aplicada
fr: Paramètres appliqués
ja: 設定を適用しました
ko: 설정이 적용되었습니다.
zh_hans: 已应用设置
zh_hant: 已應用設定

# diagnostics.lanPublicationReason.listenerDisabled
source: Listener setting disabled
ar: تم تعطيل إعداد المستمع
de: Listener-Einstellung deaktiviert
es: Configuración del oyente deshabilitada
fr: Paramètre d'écoute désactivé
ja: リスナー設定が無効です
ko: 리스너 설정이 비활성화되었습니다.
zh_hans: 监听器设置已禁用
zh_hant: 監聽器設定已停用

# diagnostics.lanPublicationReason.noContext
source: Runtime context unavailable
ar: سياق وقت التشغيل غير متاح
de: Laufzeitkontext nicht verfügbar
es: Contexto de tiempo de ejecución no disponible
fr: Contexte d'exécution indisponible
ja: ランタイムコンテキストが利用できません
ko: 런타임 컨텍스트를 사용할 수 없음
zh_hans: 运行时上下文不可用
zh_hant: 運行時上下文不可用

# diagnostics.path.direct
source: Direct
ar: مباشر
de: Direkt
es: Directo
ja: 直接
ko: 직접
zh_hans: 直接的
zh_hant: 直接的

# diagnostics.path.loopback
source: Loopback
ar: الاسترجاع
es: Bucle invertido
fr: Bouclage
ja: ループバック
ko: 루프백
zh_hans: 环回
zh_hant: 環回

# diagnostics.path.privateNetwork
source: Private network
ar: شبكة خاصة
de: Privates Netzwerk
es: Red privada
fr: Réseau privé
ja: プライベートネットワーク
ko: 사설망
zh_hans: 专网
zh_hant: 專網

# diagnostics.path.relay
source: Relay
ar: تتابع
de: Relais
es: Relé
fr: Relais
ja: リレー
ko: 계전기
zh_hans: 中继
zh_hant: 中繼

# diagnostics.path.unknown
source: Unknown path
ar: مسار غير معروف
de: Unbekannter Pfad
es: Camino desconocido
fr: Chemin inconnu
ja: 不明な経路
ko: 알 수 없는 경로
zh_hans: 未知路径
zh_hant: 未知路徑

# diagnostics.pathOperation.closed
source: Closed
ar: مغلق
de: Geschlossen
es: Cerrado
fr: Fermé
ja: 終了
ko: 닫은
zh_hans: 关闭
zh_hant: 關閉

# diagnostics.pathOperation.lagged
source: Lagged
ar: متخلفة
de: Verzögert
es: rezagado
fr: En retard
ja: 遅延
ko: 지연됨
zh_hans: 滞后
zh_hant: 滯後

# diagnostics.pathOperation.opened
source: Opened
ar: مفتوح
de: Geöffnet
es: Abierto
fr: Ouvert
ja: 開始
ko: 개설됨
zh_hans: 已开通
zh_hant: 已開通

# diagnostics.pathOperation.selected
source: Selected
ar: مختارة
de: Ausgewählt
es: Seleccionado
fr: Choisi
ja: 選択
ko: 선택된
zh_hans: 已选择
zh_hant: 已選擇

# diagnostics.phase.active
source: Active
ar: نشط
de: Aktiv
es: Activo
fr: Actif
ja: アクティブ
ko: 활성
zh_hans: 活跃
zh_hant: 使用中

# diagnostics.phase.background
source: Background
ar: خلفية
de: Hintergrund
es: Fondo
fr: Arrière-plan
ja: バックグラウンド
ko: 배경
zh_hans: 背景
zh_hant: 背景

# diagnostics.phase.inactive
source: Inactive
ar: غير نشط
de: Inaktiv
es: Inactivo
fr: Inactif
ja: 非アクティブ
ko: 비활성
zh_hans: 不活跃
zh_hant: 非使用中

# diagnostics.privateJoin.joined
source: Joined broker port
ar: انضم إلى منفذ الوسيط
de: Beigetretener Broker-Port
es: Puerto de corredor unido
fr: Port de courtier rejoint
ja: ブローカーのポートと結合済み
ko: 조인된 브로커 포트
zh_hans: 加入经纪商端口
zh_hant: 加入經紀商端口

# diagnostics.privateJoin.notConfigured
source: None configured
ar: لم يتم تكوين أي شيء
de: Keine konfiguriert
es: Ninguno configurado
fr: Aucun configuré
ja: 未設定
ko: 구성된 없음
zh_hans: 未配置
zh_hant: 未配置

# diagnostics.privateJoin.stalePorts
source: Broker ports missing or stale
ar: منافذ الوسيط مفقودة أو قديمة
de: Broker-Ports fehlen oder sind veraltet
es: Faltan puertos de intermediario o están obsoletos
fr: Ports du courtier manquants ou obsolètes
ja: ブローカーのポートが欠落または期限切れ
ko: 브로커 포트가 없거나 오래되었습니다.
zh_hans: 代理端口丢失或过时
zh_hant: 代理端口丟失或過時

# diagnostics.purpose.backgroundControl
source: Background control
ar: التحكم في الخلفية
de: Hintergrundkontrolle
es: control de fondo
fr: Contrôle d'arrière-plan
ja: バックグラウンド制御
ko: 백그라운드 제어
zh_hans: 后台控制
zh_hant: 後台控制

# diagnostics.purpose.featureLane
source: Feature lane
ar: حارة مميزة
es: carril característico
fr: Voie des fonctionnalités
ja: 機能レーン
ko: 기능 차선
zh_hans: 特色车道
zh_hant: 特色車道

# diagnostics.purpose.foregroundControl
source: Foreground control
ar: السيطرة على المقدمة
de: Vordergrundkontrolle
es: control de primer plano
fr: Contrôle du premier plan
ja: フォアグラウンド制御
ko: 전경 제어
zh_hans: 前台控制
zh_hant: 前台控制

# diagnostics.purpose.probe
source: Connection probe
ar: مسبار الاتصال
de: Verbindungssonde
es: Sonda de conexión
fr: Sonde de connexion
ja: 接続プローブ
ko: 연결 프로브
zh_hans: 连接探头
zh_hant: 連接探頭

# diagnostics.reachability.offline
source: Offline
ar: غير متصل
es: Desconectado
fr: Hors ligne
ja: オフライン
ko: 오프라인
zh_hans: 离线
zh_hant: 離線

# diagnostics.reachability.online
source: Online
ar: متصل
es: En línea
fr: En ligne
ja: オンライン
ko: 온라인
zh_hans: 在线的
zh_hant: 在線的

# diagnostics.recoveryTrigger.foreground
source: App returned to foreground
ar: عاد التطبيق إلى المقدمة
de: Die App ist wieder im Vordergrund
es: La aplicación volvió al primer plano
fr: L'application est revenue au premier plan
ja: アプリがフォアグラウンドに戻りました
ko: 앱이 포그라운드로 반환됨
zh_hans: 应用程序返回前台
zh_hant: 應用程式返回前台

# diagnostics.recoveryTrigger.livenessFailed
source: Liveness check failed
ar: فشل التحقق من الحيوية
de: Die Lebendigkeitsprüfung ist fehlgeschlagen
es: Error en la comprobación de vida
fr: La vérification de l'activité a échoué
ja: 稼働確認に失敗しました
ko: 활성 확인 실패
zh_hans: 活性检查失败
zh_hant: 活性檢查失敗

# diagnostics.recoveryTrigger.manualRetry
source: Manual retry
ar: إعادة المحاولة يدويًا
de: Manueller Wiederholungsversuch
es: Reintento manual
fr: Nouvelle tentative manuelle
ja: 手動再試行
ko: 수동 재시도
zh_hans: 手动重试
zh_hant: 手動重試

# diagnostics.recoveryTrigger.networkChanged
source: Network changed
ar: تغيرت الشبكة
de: Netzwerk geändert
es: Red cambiada
fr: Réseau modifié
ja: ネットワークが変更されました
ko: 네트워크가 변경됨
zh_hans: 网络发生变化
zh_hant: 網路發生變化

# diagnostics.recoveryTrigger.presenceNotification
source: Presence notification
ar: إشعار التواجد
de: Anwesenheitsbenachrichtigung
es: Notificación de presencia
fr: Notification de présence
ja: プレゼンス通知
ko: 존재 알림
zh_hans: 存在通知
zh_hant: 存在通知

# diagnostics.recoveryTrigger.retryDelayExpired
source: Automatic retry delay expired
ar: انتهت صلاحية مهلة إعادة المحاولة التلقائية
de: Automatische Wiederholungsverzögerung abgelaufen
es: El retraso del reintento automático expiró
fr: Le délai de nouvelle tentative automatique a expiré
ja: 自動再試行の待機時間が終了しました
ko: 자동 재시도 지연이 만료되었습니다.
zh_hans: 自动重试延迟已过期
zh_hant: 自動重試延遲已過期

# diagnostics.recoveryTrigger.streamEnded
source: Event stream ended
ar: انتهى بث الحدث
de: Der Ereignisstrom wurde beendet
es: La transmisión del evento finalizó
fr: Flux d'événements terminé
ja: イベントストリームが終了しました
ko: 이벤트 스트림이 종료되었습니다.
zh_hans: 事件流结束
zh_hant: 事件流結束

# diagnostics.recoveryTrigger.subscriptionFailed
source: Subscription failed to start
ar: فشل الاشتراك في البدء
de: Das Abonnement konnte nicht gestartet werden
es: La suscripción no pudo iniciarse
fr: L'abonnement n'a pas pu démarrer
ja: 購読を開始できませんでした
ko: 구독을 시작하지 못했습니다.
zh_hans: 订阅启动失败
zh_hant: 訂閱啟動失敗

# diagnostics.recoveryTrigger.writeTimedOut
source: Transport write timed out
ar: انتهت مهلة النقل
de: Zeitüberschreitung beim Transport-Schreibvorgang
es: Se agotó el tiempo de escritura de transporte
fr: Le délai d'écriture du transport a expiré
ja: トランスポートへの書き込みがタイムアウトしました
ko: 전송 쓰기 시간이 초과되었습니다.
zh_hans: 传输写入超时
zh_hant: 傳輸寫入逾時

# diagnostics.report.build
source: Build: %@
ar: البناء: %@
es: Compilación: %@
fr: Version : %@
ja: ビルド: %@
ko: 빌드: %@
zh_hans: 构建：%@
zh_hant: 建置：%@

# diagnostics.report.empty
source: No events recorded.
ar: لم يتم تسجيل أي أحداث.
de: Keine Ereignisse aufgezeichnet.
es: No se registraron eventos.
fr: Aucun événement enregistré.
ja: 記録されたイベントはありません。
ko: 기록된 이벤트가 없습니다.
zh_hans: 没有记录任何事件。
zh_hant: 沒有記錄任何事件。

# diagnostics.report.eventCount
source: Event count: %lld
ar: عدد الأحداث: %lld
de: Ereignisanzahl: %lld
es: Recuento de eventos: %lld
fr: Nombre d'événements : %lld
ja: イベント数: %lld
ko: 이벤트 수: %lld
zh_hans: 事件计数：%lld
zh_hant: 事件計數：%lld

# diagnostics.report.format
source: Report format: %lld
ar: تنسيق التقرير: %lld
de: Berichtsformat: %lld
es: Formato de informe: %lld
fr: Format du rapport : %lld
ja: レポート形式: %lld
ko: 보고서 형식: %lld
zh_hans: 报告格式：%lld
zh_hant: 報告格式：%lld

# diagnostics.report.generated
source: Generated: %@
ar: تم الإنشاء: %@
de: Generiert: %@
es: Generado: %@
fr: Généré : %@
ja: 生成日時: %@
ko: 생성됨: %@

# diagnostics.report.relativeSecondsUnit
source: seconds
ar: ثواني
de: Sekunden
es: artículos de segunda clase
fr: secondes
ja: 秒
ko: 초
zh_hans: 秒
zh_hant: 秒

# diagnostics.report.source
source: Source: %@
ar: المصدر: %@
de: Quelle: %@
es: Fuente: %@
ja: 生成元: %@
ko: 출처: %@

# diagnostics.report.timeline
source: Timeline (oldest first)
ar: الجدول الزمني (الأقدم أولاً)
de: Zeitleiste (Älteste zuerst)
es: Línea de tiempo (la más antigua primero)
fr: Chronologie (la plus ancienne en premier)
ja: タイムライン（古い順）
ko: 타임라인(오래된 것부터)
zh_hans: 时间轴（最旧的在前）
zh_hant: 時間軸（最舊的在前）

# diagnostics.report.title
source: cmux Iroh and transport report
ar: cmux Iroh وتقرير النقل
de: cmux Iroh und Transportbericht
es: cmux Iroh y informe de transporte
fr: cmux Iroh et rapport de transport
ja: cmux Irohとトランスポートのレポート
ko: cmux Iroh 및 운송 보고서
zh_hans: cmux Iroh 和运输报告
zh_hant: cmux Iroh 和運輸報告

# diagnostics.responder.none
source: None
ar: لا شيء
de: Keine
es: Ninguno
fr: Aucun
ja: なし
ko: 없음
zh_hans: 无
zh_hant: 無

# diagnostics.responder.other
source: Other responder
ar: مستجيب آخر
de: Anderer Antwortender
es: Otro respondedor
fr: Autre répondeur
ja: その他のレスポンダ
ko: 다른 응답자
zh_hans: 其他响应者
zh_hant: 其他響應者

# diagnostics.responder.terminalInput
source: Terminal input
ar: المدخلات الطرفية
de: Terminaleingang
es: Entrada de terminal
fr: Entrée de borne
ja: ターミナル入力
ko: 단자 입력
zh_hans: 终端输入
zh_hant: 終端機輸入

# diagnostics.responder.terminalSurface
source: Terminal surface
ar: سطح المحطة
de: Anschlussfläche
es: Superficie terminal
fr: Surface des bornes
ja: ターミナルサーフェス
ko: 단자 표면
zh_hans: 端子面
zh_hant: 端子麵

# diagnostics.responder.textField
source: Text field
ar: حقل النص
de: Textfeld
es: Campo de texto
fr: Champ de texte
ja: テキストフィールド
ko: 텍스트 필드
zh_hans: 文本字段
zh_hant: 文字欄位

# diagnostics.responder.textView
source: Text view
ar: عرض النص
de: Textansicht
es: Vista de texto
fr: Vue texte
ja: テキストビュー
ko: 텍스트 보기
zh_hans: 文本视图
zh_hant: 文字視圖

# diagnostics.role.broker
source: Broker
ar: وسيط
de: Makler
es: Corredor
fr: Courtier
ja: ブローカー
ko: 브로커
zh_hans: 经纪人
zh_hant: 經紀人

# diagnostics.role.macHost
source: Mac host
ar: مضيف ماك
es: anfitrión Mac
fr: Hôte Mac
ja: Macホスト
ko: 맥 호스트
zh_hans: Mac主机
zh_hant: Mac主機

# diagnostics.role.mobileClient
source: iOS client
ar: عميل iOS
es: cliente iOS
fr: Client iOS
ja: iOSクライアント
ko: iOS 클라이언트
zh_hans: iOS客户端
zh_hant: iOS客戶端

# diagnostics.role.relay
source: Relay
ar: تتابع
de: Relais
es: Relé
fr: Relais
ja: リレー
ko: 계전기
zh_hans: 中继
zh_hant: 中繼

# diagnostics.role.unspecified
source: Unspecified runtime
ar: وقت تشغيل غير محدد
de: Unbestimmte Laufzeit
es: Tiempo de ejecución no especificado
fr: Durée d'exécution non spécifiée
ja: 未指定のランタイム
ko: 지정되지 않은 런타임
zh_hans: 未指定的运行时间
zh_hant: 未指定的運行時間

# diagnostics.session.allPathsClosed
source: All paths closed
ar: كل الطرق مغلقة
de: Alle Wege gesperrt
es: Todos los caminos cerrados
fr: Tous les chemins fermés
ja: すべての経路が閉じました
ko: 모든 경로가 폐쇄됨
zh_hans: 所有路径已关闭
zh_hant: 所有路徑已關閉

# diagnostics.session.applicationLaneFailed
source: Application lane failed
ar: فشل مسار التطبيق
de: Die Anwendungsspur ist fehlgeschlagen
es: Error en el carril de aplicación
fr: Échec de la voie de candidature
ja: アプリケーションレーンに失敗しました
ko: 신청 차선 실패
zh_hans: 应用通道失败
zh_hant: 應用通道失敗

# diagnostics.session.closedSessionEvicted
source: Closed session evicted
ar: تم طرد الجلسة المغلقة
de: Geschlossene Sitzung geräumt
es: Sesión cerrada desalojada
fr: Séance à huis clos expulsée
ja: 終了済みセッションを破棄しました
ko: 닫힌 세션이 제거되었습니다.
zh_hans: 封闭式会议已被驱逐
zh_hant: 封閉式會議已被驅逐

# diagnostics.session.controlOwnerReleased
source: Control owner released
ar: تم إطلاق سراح مالك التحكم
de: Kontrolleigentümer freigegeben
es: Propietario del control liberado
fr: Propriétaire du contrôle libéré
ja: 制御所有者が解放されました
ko: 컨트롤 소유자가 해제됨
zh_hans: 控制所有者已释放
zh_hant: 控制所有者已釋放

# diagnostics.session.controlReadFailed
source: Control read failed
ar: فشل التحكم في القراءة
de: Das Kontrolllesen ist fehlgeschlagen
es: Error de lectura de control
fr: Échec de la lecture du contrôle
ja: 制御データの読み取りに失敗しました
ko: 컨트롤 읽기 실패
zh_hans: 控制读取失败
zh_hant: 控制讀取失敗

# diagnostics.session.controlWriteFailed
source: Control write failed
ar: فشل التحكم في الكتابة
de: Das Schreiben der Steuerung ist fehlgeschlagen
es: Error de escritura de control
fr: Échec de l'écriture du contrôle
ja: 制御データの書き込みに失敗しました
ko: 제어 쓰기 실패
zh_hans: 控制写入失败
zh_hant: 控制寫入失敗

# diagnostics.session.established
source: Established
ar: مقرر
de: Gegründet
es: Establecido
fr: Établi
ja: 確立済み
ko: 확립된
zh_hans: 已确立的
zh_hant: 已確立的

# diagnostics.session.explicitlyInvalidated
source: Explicitly invalidated
ar: بطلان صراحة
de: Ausdrücklich ungültig gemacht
es: Explícitamente invalidado
fr: Explicitement invalidé
ja: 明示的に無効化されました
ko: 명시적으로 무효화됨
zh_hans: 明确无效
zh_hant: 明確無效

# diagnostics.session.remoteClosed
source: Remote closed
ar: مغلق عن بعد
de: Fernbedienung geschlossen
es: Cerrado a distancia
fr: Fermé à distance
ja: リモート側が閉じました
ko: 원격 폐쇄
zh_hans: 远程关闭
zh_hant: 遠端關閉

# diagnostics.session.runtimeDeactivated
source: Runtime deactivated
ar: تم تعطيل وقت التشغيل
de: Laufzeit deaktiviert
es: Tiempo de ejecución desactivado
fr: Runtime désactivé
ja: ランタイムが無効化されました
ko: 런타임이 비활성화되었습니다.
zh_hans: 运行时已停用
zh_hant: 運行時已停用

# diagnostics.session.runtimeReconfigured
source: Runtime reconfigured
ar: إعادة تكوين وقت التشغيل
de: Laufzeit neu konfiguriert
es: Tiempo de ejecución reconfigurado
fr: Runtime reconfiguré
ja: ランタイムが再構成されました
ko: 재구성된 런타임
zh_hans: 运行时重新配置
zh_hant: 運行時重新配置
